wjal/stm32f4xx_drivers/Src/003_external_led_button.c
/*
 * 002_led_button.c
 *
 *  Created on: Apr 25, 2026
 *      Author: jameslittle
 */



#include "stm32f407xx.h"
#include "stm32f407xx_gpio_driver.h"

void delay(void){
	for(int i = 0; i < 500000/2;i++){
	}
}

int main(void){

	GPIO_Handle_t GPIO_led;

	GPIO_led.pGPIO_x = GPIOC;
	GPIO_led.GPIO_pin_config.GPIO_pin_number = GPIO_PIN_0;
	GPIO_led.GPIO_pin_config.GPIO_pin_mode = GPIO_MODE_OUT;
	GPIO_led.GPIO_pin_config.GPIO_pin_speed = GPIO_OP_SPEED_HI;
	//GPIO_led.GPIO_pin_config.GPIO_pin_op_type = GPIO_OP_TYPE_PP;
	//GPIO_led.GPIO_pin_config.GPIO_pin_pdown_pup_ctrl = GPIO_PULL_UP;
	GPIO_led.GPIO_pin_config.GPIO_pin_op_type = GPIO_OP_TYPE_PP;
	GPIO_led.GPIO_pin_config.GPIO_pin_pdown_pup_ctrl = GPIO_NO_RESISTOR;

	GPIO_Peri_clk_ctrl(GPIOC, ENABLE);

	GPIO_init(&GPIO_led);

	GPIO_Handle_t GPIO_button;
	GPIO_button.pGPIO_x = GPIOB;
	GPIO_button.GPIO_pin_config.GPIO_pin_number = GPIO_PIN_12;
	GPIO_button.GPIO_pin_config.GPIO_pin_mode = GPIO_MODE_IN;

	GPIO_button.GPIO_pin_config.GPIO_pin_speed = GPIO_OP_SPEED_HI;
	GPIO_led.GPIO_pin_config.GPIO_pin_pdown_pup_ctrl = GPIO_NO_RESISTOR;

	GPIO_Peri_clk_ctrl(GPIOB, ENABLE);

	GPIO_init(&GPIO_button);

	uint8_t temp;
	while(1){
		temp = GPIO_read_input_pin(GPIOB, GPIO_PIN_12);
		if(!temp){
			delay();
			GPIO_toggle_output_pin(GPIOC, GPIO_PIN_0);
		}
	};
	return 0;
};
